extension/src/InformationRegisters/мкпСемантическийСловарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>мкпСемантическийСловарь</Name>
			<Comment>Человеческие названия, синонимы и примеры для объектов и реквизитов.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>50</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОбъекта</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>255</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяПоля</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>255</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Синонимы</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>500</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>1000</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примеры</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>500</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

extension/src/CommonModules/мкпИнтроспекция/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция СписокТипов(ПараметрыЗапроса) Экспорт

	ВидФильтр = "";
	Лимит = 50;
	Курсор = "";
	Если ПараметрыЗапроса <> Неопределено Тогда
		Если ПараметрыЗапроса.Получить("kind") <> Неопределено Тогда
			ВидФильтр = Строка(ПараметрыЗапроса.Получить("kind"));
		КонецЕсли;
		Если ПараметрыЗапроса.Получить("limit") <> Неопределено Тогда
			Лимит = Число(ПараметрыЗапроса.Получить("limit"));
		КонецЕсли;
		Если ПараметрыЗапроса.Получить("cursor") <> Неопределено Тогда
			Курсор = Строка(ПараметрыЗапроса.Получить("cursor"));
		КонецЕсли;
	КонецЕсли;
	Лимит = НормализоватьЛимит(Лимит);

	Все = Новый Массив;
	ДобавитьКоллекцию(Все, Метаданные.Справочники, "catalog", ВидФильтр);
	ДобавитьКоллекцию(Все, Метаданные.Документы, "document", ВидФильтр);
	ДобавитьКоллекцию(Все, Метаданные.РегистрыСведений, "information_register", ВидФильтр);
	ДобавитьКоллекцию(Все, Метаданные.РегистрыНакопления, "accumulation_register", ВидФильтр);

	Возврат СтраницаМетаданных(Все, Лимит, Курсор);

КонецФункции

Функция ОписаниеТипа(Вид, Имя) Экспорт

	Мета = НайтиМетаданные(Вид, Имя);
	Если Мета = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Поля = Новый Массив;
	Если Вид = "catalog" Тогда
		Поля.Добавить(Поле("Ref", "uuid", "Ссылка", Истина));
		Поля.Добавить(Поле("Code", "string", "Код", Ложь));
		Поля.Добавить(Поле("Description", "string", "Наименование", Истина));
	ИначеЕсли Вид = "document" Тогда
		Поля.Добавить(Поле("Ref", "uuid", "Ссылка", Истина));
		Поля.Добавить(Поле("Number", "string", "Номер", Ложь));
		Поля.Добавить(Поле("Date", "date", "Дата", Ложь));
		Поля.Добавить(Поле("Posted", "boolean", "Проведен", Ложь));
	КонецЕсли;

	Для Каждого Реквизит Из Мета.Реквизиты Цикл
		Поля.Добавить(Поле(Реквизит.Имя, "string", Строка(Реквизит.Синоним), Ложь));
	КонецЦикла;

	ТабличныеЧасти = Новый Массив;
	Попытка
		Для Каждого ТабЧасть Из Мета.ТабличныеЧасти Цикл
			ПоляТЧ = Новый Массив;
			Для Каждого РеквизитТЧ Из ТабЧасть.Реквизиты Цикл
				ПоляТЧ.Добавить(Поле(РеквизитТЧ.Имя, "string", Строка(РеквизитТЧ.Синоним), Ложь));
			КонецЦикла;
			ТабличныеЧасти.Добавить(Новый Структура("name,synonym,fields", ТабЧасть.Имя, Строка(ТабЧасть.Синоним), ПоляТЧ));
		КонецЦикла;
	Исключение
	КонецПопытки;

	Семантика = СемантикаОбъекта(Вид, Имя);
	Результат = Новый Структура;
	Результат.Вставить("kind", Вид);
	Результат.Вставить("name", Мета.Имя);
	Результат.Вставить("synonym", Строка(Мета.Синоним));
	Результат.Вставить("description", Семантика.Описание);
	Результат.Вставить("examples", Семантика.Примеры);
	Результат.Вставить("fields", Поля);
	Результат.Вставить("tabular_sections", ТабличныеЧасти);
	Возврат Результат;

КонецФункции

Функция ПоискСемантики(ПараметрыЗапроса) Экспорт

	ЗапросТекст = "";
	Лимит = 20;
	Если ПараметрыЗапроса <> Неопределено Тогда
		Если ПараметрыЗапроса.Получить("q") <> Неопределено Тогда
			ЗапросТекст = Строка(ПараметрыЗапроса.Получить("q"));
		КонецЕсли;
		Если ПараметрыЗапроса.Получить("limit") <> Неопределено Тогда
			Лимит = Число(ПараметрыЗапроса.Получить("limit"));
		КонецЕсли;
	КонецЕсли;
	Лимит = НормализоватьЛимит(Лимит);
	Нормализованный = НРег(СокрЛП(ЗапросТекст));

	Найденные = Новый Массив;
	Ключи = Новый Соответствие;

	Если Нормализованный <> "" Тогда
		Выборка = РегистрыСведений.мкпСемантическийСловарь.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если мкпБезопасность.ЭтоСлужебныйОбъект(Выборка.ИмяОбъекта) Тогда
				Продолжить;
			КонецЕсли;
			Сен = НРег(
				Строка(Выборка.ИмяОбъекта) + " " + Строка(Выборка.Синонимы) + " "
				+ Строка(Выборка.Описание) + " " + Строка(Выборка.Примеры) + " " + Строка(Выборка.ИмяПоля));
			Если СтрНайти(Сен, Нормализованный) = 0 Тогда
				Продолжить;
			КонецЕсли;
			ДобавитьУникальный(Найденные, Ключи, Выборка.ВидОбъекта, Выборка.ИмяОбъекта, Выборка.Синонимы, Выборка.Описание, Выборка.Примеры);
		КонецЦикла;

		ДополнитьПоискомПоМетаданным(Найденные, Ключи, Нормализованный);
	КонецЕсли;

	Если Найденные.Количество() > Лимит Тогда
		Урезанные = Новый Массив;
		Для Индекс = 0 По Лимит - 1 Цикл
			Урезанные.Добавить(Найденные[Индекс]);
		КонецЦикла;
		Найденные = Урезанные;
	КонецЕсли;

	Возврат Новый Структура("query,items", ЗапросТекст, Найденные);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКоллекцию(Результат, Коллекция, Вид, ВидФильтр)

	Если ВидФильтр <> "" И ВидФильтр <> Вид Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Мета Из Коллекция Цикл
		Если мкпБезопасность.ЭтоСлужебныйОбъект(Мета.Имя) Тогда
			Продолжить;
		КонецЕсли;
		Элемент = Новый Структура;
		Элемент.Вставить("kind", Вид);
		Элемент.Вставить("name", Мета.Имя);
		Элемент.Вставить("synonym", Строка(Мета.Синоним));
		Элемент.Вставить("description", "");
		Элемент.Вставить("examples", Новый Массив);
		Результат.Добавить(Элемент);
	КонецЦикла;

КонецПроцедуры

Функция СтраницаМетаданных(Все, Лимит, Курсор)

	Элементы = Новый Массив;
	Пропустить = Курсор <> "";
	Для Каждого Элемент Из Все Цикл
		Ключ = Элемент.kind + "/" + Элемент.name;
		Если Пропустить Тогда
			Если Ключ = Курсор Тогда
				Пропустить = Ложь;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		Если Элементы.Количество() >= Лимит Тогда
			Последний = Элементы[Элементы.ВГраница()];
			Возврат Новый Структура("items,next_cursor,has_more", Элементы, Последний.kind + "/" + Последний.name, Истина);
		КонецЕсли;
		Элементы.Добавить(Элемент);
	КонецЦикла;

	Возврат Новый Структура("items,next_cursor,has_more", Элементы, Неопределено, Ложь);

КонецФункции

Функция НайтиМетаданные(Вид, Имя)

	Если Не мкпСериализация.ИмяМетаданныхБезопасно(Имя) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если мкпБезопасность.ЭтоСлужебныйОбъект(Имя) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Вид = "catalog" Тогда
		Возврат Метаданные.Справочники.Найти(Имя);
	ИначеЕсли Вид = "document" Тогда
		Возврат Метаданные.Документы.Найти(Имя);
	ИначеЕсли Вид = "information_register" Тогда
		Возврат Метаданные.РегистрыСведений.Найти(Имя);
	ИначеЕсли Вид = "accumulation_register" Тогда
		Возврат Метаданные.РегистрыНакопления.Найти(Имя);
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

Функция Поле(Имя, ТипПоля, Синоним, Обязательное)

	Возврат Новый Структура("name,type,synonym,required", Имя, ТипПоля, Синоним, Обязательное);

КонецФункции

Функция СемантикаОбъекта(Вид, Имя)

	Описание = "";
	Примеры = Новый Массив;
	Выборка = РегистрыСведений.мкпСемантическийСловарь.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидОбъекта = Вид И Выборка.ИмяОбъекта = Имя И Не ЗначениеЗаполнено(Выборка.ИмяПоля) Тогда
			Описание = Строка(Выборка.Описание);
			Если Не ПустаяСтрока(Выборка.Примеры) Тогда
				Примеры.Добавить(Строка(Выборка.Примеры));
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Новый Структура("Описание,Примеры", Описание, Примеры);

КонецФункции

Процедура ДобавитьУникальный(Найденные, Ключи, Вид, Имя, Синоним, Описание, ПримерыТекст)

	Ключ = Строка(Вид) + "/" + Строка(Имя);
	Если Ключи.Получить(Ключ) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ключи.Вставить(Ключ, Истина);
	Примеры = Новый Массив;
	Если Не ПустаяСтрока(ПримерыТекст) Тогда
		Примеры.Добавить(Строка(ПримерыТекст));
	КонецЕсли;
	Элемент = Новый Структура;
	Элемент.Вставить("kind", Строка(Вид));
	Элемент.Вставить("name", Строка(Имя));
	Элемент.Вставить("synonym", Строка(Синоним));
	Элемент.Вставить("description", Строка(Описание));
	Элемент.Вставить("examples", Примеры);
	Найденные.Добавить(Элемент);

КонецПроцедуры

Процедура ДополнитьПоискомПоМетаданным(Найденные, Ключи, Нормализованный)

	ДобавитьКоллекциюПоИмени(Найденные, Ключи, Метаданные.Справочники, "catalog", Нормализованный);
	ДобавитьКоллекциюПоИмени(Найденные, Ключи, Метаданные.Документы, "document", Нормализованный);
	ДобавитьКоллекциюПоИмени(Найденные, Ключи, Метаданные.РегистрыСведений, "information_register", Нормализованный);
	ДобавитьКоллекциюПоИмени(Найденные, Ключи, Метаданные.РегистрыНакопления, "accumulation_register", Нормализованный);

КонецПроцедуры

Процедура ДобавитьКоллекциюПоИмени(Найденные, Ключи, Коллекция, Вид, Нормализованный)

	Для Каждого Мета Из Коллекция Цикл
		Если мкпБезопасность.ЭтоСлужебныйОбъект(Мета.Имя) Тогда
			Продолжить;
		КонецЕсли;
		Сен = НРег(Мета.Имя + " " + Строка(Мета.Синоним));
		Если СтрНайти(Сен, Нормализованный) = 0 Тогда
			Продолжить;
		КонецЕсли;
		ДобавитьУникальный(Найденные, Ключи, Вид, Мета.Имя, Строка(Мета.Синоним), "", "");
	КонецЦикла;

КонецПроцедуры

Функция НормализоватьЛимит(Лимит)

	Если Лимит < 1 Тогда
		Возврат 1;
	КонецЕсли;
	Если Лимит > 500 Тогда
		Возврат 500;
	КонецЕсли;
	Возврат Лимит;

КонецФункции

#КонецОбласти
